In [1]:
import pandas as pd

In [2]:
names = ['Airfish', 'Seren', 'Move-ez', 'MAVERICK', 'Pandawacakra', 'The Zero Heroes', 'HKU-ARG', 'FlyLite', 'NI Aerospace', 'Waitless Technology Group']

In [3]:
df = pd.read_csv('video_data.csv')

In [4]:
df

,Airfish,Seren,Move-ez,MAVERICK,Pandawacakra,The Zero Heroes,HKU-ARG,FlyLite,NI Aerospace,Waitless Technology Group
0,124,107,68,26,20,5,2,1,1,0

In [5]:
from lxml import html
import requests

In [6]:
page = requests.get('https://www.airbus-fyi.com/video-competition/')
tree = html.fromstring(page.content)

In [7]:
#This will create a list of teams:
teams = tree.xpath('//span[@class="teamname"]/text()')
#This will create a list of totals
totals = tree.xpath('//span[@class="tot"]/text()')

In [8]:
#create dictionary for mapping indices
dct = {'Airfish':0,'Seren':1, 'Move-ez':2,'MAVERICK':3,'Pandawacakra':4, 'The Zero Heroes':5,'HKU-ARG':6,'FlyLite':7,'NI Aerospace':8,'Waitless Technology Group':9}

In [9]:
# put the mapping in to a list
mapping = [dct[k] for k in teams]

In [10]:
# create an empty list 
import numpy as np
a_list = np.empty(10, dtype=int)

In [11]:
for a in  mapping:
    a_list[a] = totals[mapping.index(a)]

In [12]:
df2 = pd.DataFrame([a_list], columns=names)

In [13]:
df = pd.concat([df,df2])

In [14]:
df.to_csv('video_data.csv', index=False)

,Airfish,Seren,Move-ez,MAVERICK,Pandawacakra,The Zero Heroes,HKU-ARG,FlyLite,NI Aerospace,Waitless Technology Group
0,124,107,68,26,20,5,2,1,1,0
0,124,108,68,26,20,5,2,1,1,0